//написати скріпт підрахунку суми покупки зі знижкою в залежності
//від потраченої суми за весь час
//+загальна сума витрат зберігається в змінній totalSpent
//+загальна сума платежу зберігається в payment
//+знижка зберігається в змінній discount
//якщо потрачено [100 - 1000) - бронзовий партнер, зижка 2%
//якщо потрачено [1000 - 5000) - срібний партнер, зижка 5%
//якщо потрачено більше [5000 - золотий партнер, зижка 10%
//якщо потрачено менше 100) - не партнер, зижка 0%

//в результаті вивести повідомлення:
//"оформляємо замовлення на суму [сума] зі знижкою [знижка]%"

let totalSpent = 20000
let payment = 1000
let discount = 0

if (totalSpent >= 100 && totalSpent < 1000) {
    discount = 0.02
    console.log('бронзовий партнер, зижка 2%')

} else if (totalSpent >= 1000 && totalSpent < 5000) {
    discount = 0.05
    console.log('бронзовий партнер, зижка 5%')

} else if (totalSpent >= 5000) {
    discount = 0.10
    console.log('золотий партнер, зижка 10%')

} else {
    console.log('не партнер, зижка 0%')
}


payment -= payment * discount //мінусує одразу знижку з payment

console.log(`оформляємо замовлення на суму ${payment} зі знижкою ${discount * 100}%`) //помножити на 100 зроблено для того щоб в консолі виводити ціле число знижки, а не 0.02 чи 0.05 і т.д.

totalSpent += payment

console.log(`Загальна сума витрат в магазині за весь час ${totalSpent}`)