//написати скріпт опрацювання покупки в магазині
//баланс користувача зберігається в змінній balance
//сума покупки зберігається в змінній payment

//перед покупкою вивести повідомлення: Загальна вартість замовлення
//[число] кедитів. Перевіряємо к-сть доступних кредитів:
// +якщо сума покупки не перевищує баланс:
// -вирахувати з балансу суму покупки(вивести повідомлення на рах. залишилося [число] кредитів)
// +якщо сума покупки перевищує баланс:
// -вивести повідомлення(на рах. не достатня сума для проведення операції)
//в кінці вивести повідомлення (операція завершена)

const balance = 10000
const payment = 4500

console.log(`Загальна вартість замовлення ${payment}`)
if (payment > balance) {
    console.log('на рах. не достатня сума для проведення операції')
    
} else {
    console.log(`на рах. залишилося ${balance- payment} кредитів`)
}
console.log('операція завершена')